package org.endless.ddd.starter.common.config.error.code.type;

import lombok.AllArgsConstructor;
import lombok.Getter;
import lombok.ToString;
import org.endless.ddd.starter.common.config.error.code.ErrorCode;

/**
 * DDDErrorCode
 * <p>
 * create 2025/08/11 18:35
 * <p>
 * update 2025/08/11 18:35
 *
 * @author Deng Haozhi
 * @since 1.0.0
 */
@Getter
@ToString
@AllArgsConstructor
public enum DDDErrorCode implements ErrorCode {

    // DDD错误码
    // 命令处理器
    DCD0000("DCD0000", "命令处理失败"),
    DCD0001("DCD0001", "创建命令处理失败"),
    DCD0002("DCD0002", "删除命令处理失败"),
    DCD0003("DCD0003", "修改命令处理失败"),
    DCD0010("DCD0010", "命令未找到相关信息"),
    DCD9000("DCD9000", "命令处理状态未知"),
    DCD9001("DCD9001", "创建命令处理状态未知"),
    DCD9002("DCD9002", "删除命令处理状态未知"),
    DCD9003("DCD9003", "修改命令处理状态未知"),
    // 查询处理器
    DQR0000("DQR0000", "查询处理失败"),
    DQR0001("DQR0001", "查询未找到相关信息"),
    // 领域聚合
    DAG0000("DAG0000", "领域聚合处理失败"),
    DAG0001("DAG0001", "领域聚合为空"),
    DAG0002("DAG0002", "领域聚合校验失败"),
    DAG0100("DAG0100", "领域聚合方法参数为空"),
    DAG0101("DAG0101", "领域聚合方法参数校验失败"),
    DAG0103("DAG0103", "领域聚合方法返回值为空"),
    DAG0104("DAG0104", "领域聚合方法返回值校验失败"),
    DAG0110("DAG0110", "领域聚合创建失败"),
    DAG0111("DAG0111", "领域聚合删除失败"),
    DAG0112("DAG0112", "领域聚合修改失败"),
    DAG0200("DAG0200", "领域聚合增加子项失败"),
    DAG0201("DAG0201", "领域聚合增加子项列表失败"),
    DAG0202("DAG0202", "领域聚合删除子项失败"),
    DAG0203("DAG0203", "领域聚合删除子项列表失败"),
    // 领域实体
    DEN0000("DEN0000", "领域实体处理失败"),
    DEN0001("DEN0001", "领域实体为空"),
    DEN0002("DEN0002", "领域实体校验失败"),
    DEN0100("DEN0100", "领域实体创建失败"),
    DEN0101("DEN0101", "领域实体删除失败"),
    DEN0102("DEN0102", "领域实体修改失败"),
    // 领域事件
    DEV0000("DSV0000", "领域事件处理失败"),
    DEV9000("DEV9000", "领域事件处理状态未知"),
    // 领域服务
    DSV0000("DSV0000", "领域服务处理失败"),
    DSV9000("DSV9000", "领域服务处理状态未知"),
    // 枚举
    DEM0000("DEM0000", "枚举处理失败"),
    // 值对象
    DVO0000("DVO0000", "值对象处理失败"),
    DVO0001("DVO0001", "值对象为空"),
    DVO0002("DVO0002", "值对象校验失败"),

    // 数据仓储实体
    DDR0000("DDR0000", "数据仓储实体为空"),
    DDR0001("DDR0001", "数据仓储实体校验失败"),
    DDR0002("DDR0002", "数据仓储增加子项失败"),

    // 数据管理器处理失败
    DDM0000("DDM0000", "数据管理器处理失败"),
    DDM0001("DDM0001", "数据管理器保存数据失败"),
    DDM0002("DDM0002", "数据管理器删除数据失败"),
    DDM0003("DDM0003", "数据管理器修改数据失败"),
    DDM0010("DDM0010", "数据管理器查询数据失败"),
    DDM0011("DDM0011", "数据管理器未查询到相关数据"),
    DDM0100("DDM0100", "数据管理器请求参数为空"),
    // 数据管理器状态未知
    DDM9000("DDM9000", "数据管理器处理状态未知"),
    DDM9001("DDM9001", "数据管理器保存数据状态未知"),
    DDM9002("DDM9002", "数据管理器删除数据状态未知"),
    DDM9003("DDM9003", "数据管理器修改数据状态未知"),

    // 传输对象
    DTO0000("DTO0000", "传输对象为空"),
    DTO0001("DTO0001", "传输对象校验失败"),
    // 请求传输对象
    DTO1000("DTO1000", "请求传输对象为空"),
    DTO1001("DTO1001", "请求传输对象校验失败"),
    DTO1100("DTO1100", "命令请求传输对象为空"),
    DTO1101("DTO1101", "命令请求传输对象校验失败"),
    DTO1200("DTO1200", "查询请求传输对象为空"),
    DTO1201("DTO1201", "查询请求传输对象校验失败"),
    DTO1300("DTO1300", "被动请求传输对象为空"),
    DTO1301("DTO1301", "被动请求传输对象校验失败"),
    // 响应传输对象
    DTO2000("DTO2000", "响应传输对象为空"),
    DTO2001("DTO2000", "响应传输对象校验失败"),
    DTO2100("DTO2100", "命令响应传输对象为空"),
    DTO2101("DTO2101", "命令响应传输对象校验失败"),
    DTO2200("DTO2200", "查询响应传输对象为空"),
    DTO2201("DTO2201", "查询响应传输对象校验失败"),
    DTO2300("DTO2300", "被动响应传输对象为空"),
    DTO2301("DTO2301", "被动响应传输对象校验失败");

    private final String code;

    private final String description;

    public static void register() {
        for (DDDErrorCode value : values()) {
            ErrorCode.register(value);
        }
    }
}
